randread/128_node/job_1470989_fiojob_64/nid00024_fiojob_64/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 64 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=64): err= 0: pid=225817: Mon Jul 19 22:42:51 2021
  read: IOPS=554, BW=2219KiB/s (2272kB/s)(650MiB/300030msec)
    slat (usec): min=574, max=3169.9k, avg=115320.85, stdev=54108.81
    clat (usec): min=13, max=44403k, avg=27995828.63, stdev=7610305.05
     lat (msec): min=4, max=44551, avg=28111.15, stdev=7626.31
    clat percentiles (msec):
     |  1.00th=[  321],  5.00th=[ 8087], 10.00th=[17113], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min= 1008, max=14024, per=99.45%, avg=2207.39, stdev=10.74, samples=34353
   iops        : min=  252, max= 3506, avg=551.85, stdev= 2.68, samples=34353
  lat (usec)   : 20=0.02%, 50=0.02%
  lat (msec)   : 10=0.02%, 20=0.03%, 50=0.09%, 100=0.17%, 250=0.44%
  lat (msec)   : 500=0.65%, 750=0.48%, 1000=0.43%, 2000=0.70%, >=2000=96.97%
  cpu          : usr=0.03%, sys=0.17%, ctx=166921, majf=0, minf=18929
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.6%, 32=1.2%, >=64=97.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=166454,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=2219KiB/s (2272kB/s), 2219KiB/s-2219KiB/s (2272kB/s-2272kB/s), io=650MiB (682MB), run=300030-300030msec